const first_name_cn = [
    //自定义
    "天", "地", "玄", "黄", "宇", "宙", "洪荒", "变态", "不死", "婆婆", "老爷", "少爷",
    "一", "二", "九", "日", "月", "星", "辰", "数", "理", "化", "生", "阴", "阳", "太极",
    //男名
    '彦屏', '智浩', '敏文', '皓忠', '振东', '皓峰', '璟烨', '子恒', '梓豪', '佩璟',
    '敬涛', '蔚菁', '芷蔚', '志平', '洋珈', '越林', '泳合', '冀霁', '渤林', '悦晨',
    '润临', '鹊翔', '钎震', '皓睿', '文林', '志元', '汕睿', '孝林', '凯昕', '宇铭',
    '皓予', '肖恩', '茂帜', '品壮', '辉盛', '泽辉', '城咏', '翀哲', '陆修', '昌杰',
    '管卓', '东招', '蜀丹', '朋夕', '余同', '汐茗', '国翱', '冉骏', '初云', '凌天',
    '子墨', '昊阳', '昊天', '浩天', '浅之', '傲天', '凌霄', '拓野', '熙慕', '兮夕',
    '少风', '子歌', '曜司', '御风', '君逸', '煜政', '雨浩', '皓彦', '绍峰', '子轩',
    '思良', '启邦', '均雄', '智新', '胜佑', '俊涛', '佩玮', '毅风', '枞雄', '韵林',
    '晓昊', '桂建', '湘榆', '湛豪', '元源', '子博', '语霖', '泰安', '梓鸿', '恩泽',
    '锐博', '方迪', '宏裕', '新铭', '昕瑜', '熙彦', '嘉宁', '敬宣',
    //女名
    '静晗', '欣怡', '玉涵', '娴雅', '若冰', '韵涵', '茵灵', '依凌', '心洁', '寒月',
    '心逸', '雅馨', '慧中', '思聪', '高云', '云岫', '雨露', '皓薰', '汐情', '雅馨',
    '景辉', '永豪', '晨龙', '不凡', '梦瑶', '月柯', '语琦', '子晨', '英杰', '雨露',
    '婉莹', '顺庆', '氏政', '义统', '唐秀', '唐宣', '隆景', '静婷', '雯倩', '高诗',
    '晗羿', '鸣浩', '泽辉', '奇凡', '煜晨', '咏波', '绍峰', '一明', '佳雨', '霈泽',
    '文波', '倩雪', '茹雪', '正梅', '美琳', '欢馨', '优璇', '雨嘉', '雪珍', '海之',
    '小蕊', '又琴', '香彤', '语梦', '惜蕊', '迎彤', '以丹', '依凝', '如柏', '雁菱',
    '凝竹', '宛白', '初柔', '南蕾', '书萱', '梦槐', '南琴', '绿海', '沛儿', '觅珍',
    '丹雪', '元枫', '思天', '如松', '妙晴', '谷秋', '妙松', '晓夏', '宛筠', '碧琴'
]
const last_name_cn = [
    //百家姓
    '赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨', '朱', '秦', '尤', '许',
    '何', '吕', '施', '张', '孔', '曹', '严', '华', '金', '魏', '陶', '姜', '戚', '谢', '邹', '喻', '柏', '水', '窦', '章',
    '云', '苏', '潘', '葛', '奚', '范', '彭', '郎', '鲁', '韦', '昌', '马', '苗', '凤', '花', '方', '俞', '任', '袁', '柳',
    '酆', '鲍', '史', '唐', '费', '廉', '岑', '薛', '雷', '贺', '倪', '汤', '滕', '殷', '罗', '毕', '郝', '邬', '安', '常',
    '乐', '於', '时', '傅', '皮', '卞', '齐', '康', '伍', '余', '元', '卜', '顾', '孟', '平', '黄', '和', '穆', '萧', '尹',
    '姚', '邵', '湛', '汪', '祁', '毛', '禹', '狄', '米', '贝', '明', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅', '庞',
    '熊', '纪', '舒', '屈', '项', '祝', '董', '梁', '杜', '阮', '蓝', '闵', '席', '季', '麻', '强', '贾', '路', '娄', '危',
    '江', '童', '颜', '郭', '梅', '盛', '林', '刁', '锺', '徐', '邱', '骆', '高', '夏', '蔡', '田', '樊', '胡', '淩', '霍',
    '虞', '万', '支', '柯', '昝', '管', '卢', '莫', '柯', '房', '裘', '缪', '干', '解', '应', '宗', '丁', '宣', '贲', '邓',
    '郁', '单', '杭', '洪', '包', '诸', '左', '石', '崔', '吉', '钮', '龚', '程', '嵇', '邢', '滑', '裴', '陆', '荣', '翁',
    '荀', '羊', '于', '惠', '甄', '曲', '家', '封', '芮', '羿', '储', '靳', '汲', '邴', '糜', '松', '井', '段', '富', '巫',
    '乌', '焦', '巴', '弓', '牧', '隗', '山', '谷', '车', '侯', '宓', '蓬', '全', '郗', '班', '仰', '秋', '仲', '伊', '宫',
    '甯', '仇', '栾', '暴', '甘', '钭', '历', '戎', '祖', '武', '符', '刘', '景', '詹', '束', '龙', '叶', '幸', '司', '韶',
    '郜', '黎', '蓟', '溥', '印', '宿', '白', '怀', '蒲', '邰', '从', '鄂', '索', '咸', '籍', '赖', '卓', '蔺', '屠', '蒙',
    '池', '乔', '阳', '郁', '胥', '能', '苍', '双', '闻', '莘', '党', '翟', '谭', '贡', '劳', '逄', '姬', '申', '扶', '堵',
    '冉', '宰', '郦', '雍', '却', '璩', '桑', '桂', '濮', '牛', '寿', '通', '边', '扈', '燕', '冀', '浦', '尚', '农', '温',
    '别', '庄', '晏', '柴', '瞿', '阎', '充', '慕', '连', '茹', '习', '宦', '艾', '鱼', '容', '向', '古', '易', '慎', '戈',
    '廖', '庾', '终', '暨', '居', '衡', '步', '都', '耿', '满', '弘', '匡', '国', '文', '寇', '广', '禄', '阙', '东', '欧',
    '殳', '沃', '利', '蔚', '越', '夔', '隆', '师', '巩', '厍', '聂', '晁', '勾', '敖', '融', '冷', '訾', '辛', '阚', '那',
    '简', '饶', '空', '曾', '毋', '沙', '乜', '养', '鞠', '须', '丰', '巢', '关', '蒯', '相', '查', '後', '荆', '红', '游',
    '竺', '权', '逮', '盍', '益', '桓', '公',
    //复姓
    '万俟', '司马', '上官', '欧阳', '夏侯', '诸葛', '闻人', '东方', '赫连', '皇甫', '尉迟', '公羊', '澹台', '公冶', '宗政',
    '濮阳', '淳于', '单於', '太叔', '申屠', '公孙', '仲孙', '轩辕', '令狐', '徐离', '宇文', '长孙', '慕容', '司徒', '司空'
]
module.exports = { first_name_cn, last_name_cn }